Revit 2026 API

# BuiltInFailuresTextFailures Class

---

Failures about Text.

SystemObject Autodesk.Revit.DBBuiltInFailuresTextFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class TextFailures
```
```vb
Public NotInheritable Class TextFailures
```
```cpp
public ref class TextFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type TextFailures = class end
```

The BuiltInFailuresTextFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CannotCreateModeltext | Can't create Model Text. |
|  | ModeltextIsEmpty | Model Text deleted because it consists entirely of spaces and/or carriage returns. |

#### Reference

Autodesk.Revit.DB Namespace